sergev/pic32prog/adapter-bitbang.c
    bitbang_send(a, 1, 1, 5, TAP_SW_ETAP, 0);       /* Send command. */         // 6.
    bitbang_send(a, 1, 1, 5, ETAP_EJTAGBOOT, 0);    /* Send command. */         // 7.


    bitbang_send(a, 1, 1, 5, TAP_SW_MTAP, 0);       /* Send command. */         // 8.
    bitbang_send(a, 1, 1, 5, MTAP_COMMAND, 0);      /* Send command. */         // 9.
    bitbang_send(a, 0, 0, 8, MCHP_DEASSERT_RST, 0); /* Xfer data. */            // 10.

    if (memcmp(a->adapter.family_name, "mz", 2) != 0)   // not needed for MZ processors
        bitbang_send(a, 0, 0, 8, MCHP_FLASH_ENABLE, 0); /* Xfer data. */        // 11.

    bitbang_send(a, 1, 1, 5, TAP_SW_ETAP, 0);       /* Send command. */         // 12.
}

//
// Shouldn't XferFastData check the value of PrAcc returned in
// the LSB? We don't seem to be even reading this back.
// UPDATE1: The check is not needed in 4-wire JTAG mode, seems
// to only be required if in 2-wire ICSP mode. It would also
// slow us down horribly.
// UPDATE2: We are operating at such a slow speed that the PrAcc
// check is not really needed. To date, have never seen PrAcc != 1
//
static void xfer_fastdata(bitbang_adapter_t *a, unsigned word)
{
    a->FDataCount++;

    if (CFG2 == 1)
        bitbang_send(a, 0, 0, 33, (unsigned long long) word << 1, 0);

    if (CFG2 == 2) {
        bitbang_send(a, 0, 0, 33, (unsigned long long) word << 1, 2);
        unsigned status = bitbang_recv(a);
        if (! (status & 1)) {
            printf("!");
            fflush(stdout);
        }
    }
    //
    // could add in code above to handle retrying if PrAcc == 0
    //
    // a better (faster) approach may be to 'accumulate' PrAcc at the
    // programming adaptor, and then check the value at the end of a series
    // of xfer_fastdata calls. we would need to implement an extra ascii
    // command to use instead of 'D' (0x44) in the TDI header; '+' could be
    // used as the check command (PrAcc |= TDO), while '=' used to read out
    // the result (PrAcc) and reset the accumulator (PrAcc = 1) at the
    // programming adaptor.
}

static void xfer_instruction(bitbang_adapter_t *a, unsigned instruction)
{
    unsigned ctl;

    if (debug_level > 1)
        fprintf(stderr, "xfer instruction %08x\n", instruction);

    // Select Control Register
    bitbang_send(a, 1, 1, 5, ETAP_CONTROL, 0);        /* Send command. */

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set

    int i = 0;
    do {
        if (i > 100)
            bitbang_delay10mS(a, 1);
        bitbang_send(a, 0, 0, 32, CONTROL_PRACC |   /* Xfer data. */
                                 CONTROL_PROBEN |
                               CONTROL_PROBTRAP |
                       /* CONTROL_EJTAGBRK */ 0, 1);  // this bit should NOT be set

        // Microchip document 60001145N, "PIC32 Flash Programming
        // Specification, DS60001145N page 18 stipulates 0x0004C000:
        // CONTROL_PRACC | CONTROL_PROBEN | CONTROL_PROBTRAP

        ctl = bitbang_recv(a);
        i++;
    } while (! (ctl & CONTROL_PRACC) && i < 150);

    if (i == 150) {
        fprintf(stderr, "PE response, PrAcc not set (in XferInstruction)\n");
        exit(-1);
    }

    // Select Data Register
    // Send the instruction
    bitbang_send(a, 1, 1, 5, ETAP_DATA, 0);           /* Send command. */
    bitbang_send(a, 0, 0, 32, instruction, 0);        /* Send data. */

    // Tell CPU to execute instruction
    bitbang_send(a, 1, 1, 5, ETAP_CONTROL, 0);        /* Send command. */
    bitbang_send(a, 0, 0, 32, CONTROL_PROBEN |        /* Send data. */
                              CONTROL_PROBTRAP, 0);
}

static unsigned get_pe_response(bitbang_adapter_t *a)
{
    unsigned ctl, response;

    // Select Control Register
    bitbang_send(a, 1, 1, 5, ETAP_CONTROL, 0);        /* Send command. */

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set

    int i = 0;
    do {
        if (i > 100)
            bitbang_delay10mS(a, 2);
        bitbang_send(a, 0, 0, 32, CONTROL_PRACC |     /* Xfer data. */
                                 CONTROL_PROBEN |
                               CONTROL_PROBTRAP |
                            /* CONTROL_EJTAGBRK */ 0, 1);  // this bit should NOT be set

        // Microchip document 60001145N, "PIC32 Flash Programming
        // Specification, DS60001145N page 30 stipulates 0x0004C000:
        // CONTROL_PRACC | CONTROL_PROBEN | CONTROL_PROBTRAP

        ctl = bitbang_recv(a);
        i++;
    } while (! (ctl & CONTROL_PRACC) && i < 150);

    if (i == 150) {
        fprintf(stderr, "PE response, PrAcc not set (in GetPEResponse)\n");
        exit(-1);
    }

    // Select Data Register
    // Send the instruction
    bitbang_send(a, 1, 1, 5, ETAP_DATA, 0);           /* Send command. */
    bitbang_send(a, 0, 0, 32, 0, 1);                  /* Get data. */
    response = bitbang_recv(a);

    // Tell CPU to execute NOP instruction
    bitbang_send(a, 1, 1, 5, ETAP_CONTROL, 0);        /* Send command. */
    bitbang_send(a, 0, 0, 32, CONTROL_PROBEN |        /* Send data. */
                              CONTROL_PROBTRAP, 0);
    if (debug_level > 1)
        fprintf(stderr, "get PE response %08x\n", response);
    return response;
}

/*
 * Read a word from memory (without PE).
 *
 * Only used to read configuration words.
 */
static unsigned bitbang_read_word(adapter_t *adapter, unsigned addr)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;
    unsigned addr_lo = addr & 0xFFFF;
    unsigned addr_hi = (addr >> 16) & 0xFFFF;

    if (DBG2)
        fprintf(stderr, "read_word\n");

    serial_execution(a);

    xfer_instruction(a, 0x3c04bf80);            // lui s3, 0xFF20
    xfer_instruction(a, 0x3c080000 | addr_hi);  // lui t0, addr_hi
    xfer_instruction(a, 0x35080000 | addr_lo);  // ori t0, addr_lo
    xfer_instruction(a, 0x8d090000);            // lw t1, 0(t0)
    xfer_instruction(a, 0xae690000);            // sw t1, 0(s3)

    bitbang_send(a, 1, 1, 5, ETAP_FASTDATA, 0); /* Send command. */
    bitbang_send(a, 0, 0, 33, 0, 1);            /* Get fastdata. */
    unsigned word = bitbang_recv(a) >> 1;

    if (debug_level > 0)
        fprintf(stderr, "read word at %08x -> %08x\n", addr, word);
    return word;
}

