sergev/pic32prog/adapter-bitbang.c
/*
 * Read a memory block.
 */
static void bitbang_read_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;
    unsigned words_read, i;

    if (DBG2)
        fprintf(stderr, "read_data\n");

    if (! a->use_executive) {
        /* Without PE. */
        for (i = nwords; i > 0; i--) {
            *data++ = bitbang_read_word(adapter, addr);
            addr += 4;
        }
        return;
    }

    /* Use PE to read memory. */
    for (words_read = 0; words_read < nwords; words_read += 32) {

        bitbang_send(a, 1, 1, 5, ETAP_FASTDATA, 0);
        xfer_fastdata(a, PE_READ << 16 | 32);       /* Read 32 words */
        xfer_fastdata(a, addr);                     /* Address */

        unsigned response = get_pe_response(a);     /* Get response */
        if (response != PE_READ << 16) {
            fprintf(stderr, "bad READ response = %08x, expected %08x\n",
                                               response,     PE_READ << 16);
            exit(-1);
        }
        for (i = 0; i < 32; i++) {
            *data++ = get_pe_response(a);           /* Get data */
        }
        addr += 32 * 4;
    }
}

/*
 * Download programming executive (PE).
 */
static void bitbang_load_executive(adapter_t *adapter,
    const unsigned *pe, unsigned nwords, unsigned pe_version)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;

    a->use_executive = 1;
    serial_execution(a);

    printf("   Loading PE: ");
    fflush(stdout);

    if (memcmp(a->adapter.family_name, "mz", 2) != 0) {            // steps 1. to 3. not needed for MZ
        /* Step 1. */
        xfer_instruction(a, 0x3c04bf88);   // lui a0, 0xbf88
        xfer_instruction(a, 0x34842000);   // ori a0, 0x2000 - address of BMXCON
        xfer_instruction(a, 0x3c05001f);   // lui a1, 0x1f
        xfer_instruction(a, 0x34a50040);   // ori a1, 0x40   - a1 has 001f0040
        xfer_instruction(a, 0xac850000);   // sw  a1, 0(a0)  - BMXCON initialized
        printf("1");
        fflush(stdout);

        /* Step 2. */
        xfer_instruction(a, 0x34050800);   // li  a1, 0x800  - a1 has 00000800
        xfer_instruction(a, 0xac850010);   // sw  a1, 16(a0) - BMXDKPBA initialized
        printf(" 2");
        fflush(stdout);

        /* Step 3. */
        xfer_instruction(a, 0x8c850040);   // lw  a1, 64(a0) - load BMXDMSZ
        xfer_instruction(a, 0xac850020);   // sw  a1, 32(a0) - BMXDUDBA initialized
        xfer_instruction(a, 0xac850030);   // sw  a1, 48(a0) - BMXDUPBA initialized
        printf(" 3");
        fflush(stdout);
    }

    /* Step 4. */
    xfer_instruction(a, 0x3c04a000);   // lui a0, 0xa000
    xfer_instruction(a, 0x34840800);   // ori a0, 0x800  - a0 has a0000800
    printf(" 4 (LDR)");
    fflush(stdout);

    /* Download the PE loader. */
    int i;
    for (i = 0; i < PIC32_PE_LOADER_LEN; i += 2) {
        /* Step 5. */
        unsigned opcode1 = 0x3c060000 | pic32_pe_loader[i];
        unsigned opcode2 = 0x34c60000 | pic32_pe_loader[i+1];

        xfer_instruction(a, opcode1);      // lui a2, PE_loader_hi++
        xfer_instruction(a, opcode2);      // ori a2, PE_loader_lo++
        xfer_instruction(a, 0xac860000);   // sw  a2, 0(a0)
        xfer_instruction(a, 0x24840004);   // addiu a0, 4
    }
    printf(" 5");
    fflush(stdout);

    /* Jump to PE loader (step 6). */
    xfer_instruction(a, 0x3c19a000);   // lui t9, 0xa000
    xfer_instruction(a, 0x37390800);   // ori t9, 0x800  - t9 has a0000800
    xfer_instruction(a, 0x03200008);   // jr  t9
    xfer_instruction(a, 0x00000000);   // nop
    printf(" 6");
    fflush(stdout);

    /* Switch from serial to fast execution mode. */
    //bitbang_send(a, 1, 1, 5, TAP_SW_ETAP, 0);
    //bitbang_send(a, 6, 31, 0, 0, 0);             /* TMS 1-1-1-1-1-0 */

    //
    // the above two lines are not present in the Microchip programming specs
    //

    /* Send parameters for the loader (step 7-A).
     * PE_ADDRESS = 0xA000_0900,
     * PE_SIZE */
    bitbang_send(a, 1, 1, 5, ETAP_FASTDATA, 0);  /* Send command. */
    xfer_fastdata(a, 0xa0000900);
    xfer_fastdata(a, nwords);
    printf(" 7a (PE)");
    fflush(stdout);

    /* Download the PE itself (step 7-B). */
    for (i = 0; i < nwords; i++) {
        xfer_fastdata(a, *pe++);
    }
    bitbang_delay10mS(a, 3);
    printf(" 7b");
    fflush(stdout);

    /* Download the PE instructions. */
    xfer_fastdata(a, 0);                       /* Step 8 - jump to PE. */
    xfer_fastdata(a, 0xDEAD0000);
    bitbang_delay10mS(a, 3);
    printf(" 8");
    fflush(stdout);

    xfer_fastdata(a, PE_EXEC_VERSION << 16);

    unsigned version = get_pe_response(a);
    if (version != (PE_EXEC_VERSION << 16 | pe_version)) {
        fprintf(stderr, "\nbad PE version = %08x, expected %08x\n",
                       version, PE_EXEC_VERSION << 16 | pe_version);
        exit(-1);
    }

    printf(" v%04x\n", version & 0xFFFF);

    if (debug_level > 0)
        fprintf(stderr, "PE version = %04x\n", version & 0xffff);
}

/*
 * Erase all flash memory.
 */
static void bitbang_erase_chip(adapter_t *adapter)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;

    if (DBG2)
        fprintf(stderr, "erase_chip\n");

    bitbang_send(a, 1, 1, 5, TAP_SW_MTAP, 0);    /* Send command. */
    bitbang_send(a, 1, 1, 5, MTAP_COMMAND, 0);   /* Send command. */
    bitbang_send(a, 0, 0, 8, MCHP_ERASE, 0);     /* Xfer data. */

    if (memcmp(a->adapter.family_name, "mz", 2) == 0)
        bitbang_send(a, 0, 0, 8, MCHP_DEASSERT_RST, 0);      // needed for PIC32MZ devices only.

    int i = 0;
    unsigned status;
    do {
        bitbang_delay10mS(a, 0);
        bitbang_send(a, 0, 0, 8, MCHP_STATUS, 1);    /* Xfer data. */
        status = bitbang_recv(a);
        i++;
    } while ((status & (MCHP_STATUS_CFGRDY |
                        MCHP_STATUS_FCBUSY)) != MCHP_STATUS_CFGRDY && i < 100);

    if (i == 100) {
        fprintf(stderr, "invalid status = %04x (in erase chip)\n", status);
        exit(-1);
    }
    printf("(%imS) ", i * 10);
    fflush(stdout);
}

