sergev/pic32prog/adapter-bitbang.c
/*
 * Write a word to flash memory. (only seems to be used to write the four configuration words)
 *
 * !!!!!!!!!! WARNING !!!!!!!!!!
 * on PIC32MZ EC family devices PE_WORD_PROGRAM will not generate the ECC parity bits;
 * instead should use QUAD_WORD_PGRM to program all four configuration words at once.
 * !!!!!!!!!! WARNING !!!!!!!!!!
 */
static void bitbang_program_word(adapter_t *adapter,
    unsigned addr, unsigned word)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;

    if (DBG2)
        fprintf(stderr, "program_word\n");

    if (debug_level > 0)
        fprintf(stderr, "program word at %08x: %08x\n", addr, word);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "slow flash write not implemented yet\n");
        exit(-1);
    }

    if (memcmp(a->adapter.family_name, "mz", 2) == 0) {
        printf("!ECC!");                        // warn if word-write to MZ processor
        fflush(stdout);
    }

    /* Use PE to write flash memory. */
    bitbang_send(a, 1, 1, 5, ETAP_FASTDATA, 0); /* Send command. */
    xfer_fastdata(a, PE_WORD_PROGRAM << 16 | 2);
    xfer_fastdata(a, addr);                     /* Send address. */
    xfer_fastdata(a, word);                     /* Send word. */

    unsigned response = get_pe_response(a);
    if (response != (PE_WORD_PROGRAM << 16)) {
        fprintf(stderr, "\nfailed to program word %08x at %08x, reply = %08x\n",
                                                   word,   addr,       response);
        exit(-1);
    }
}

/*
 * Flash write row of memory.
 */
static void bitbang_program_row(adapter_t *adapter, unsigned addr,
    unsigned *data, unsigned words_per_row)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;

    if (DBG2)
        fprintf(stderr, "program_row\n");
    if (DBG3)
        fprintf(stderr, "\nprogramming %u words at %08x ",
                                   words_per_row,   addr);

    if (debug_level > 0)
        fprintf(stderr, "row program %u words at %08x\n", words_per_row, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "slow flash write not implemented yet\n");
        exit(-1);
    }

    /* Use PE to write flash memory. */
    bitbang_send(a, 1, 1, 5, ETAP_FASTDATA, 0);  /* Send command. */
    xfer_fastdata(a, PE_ROW_PROGRAM << 16 | words_per_row);
    xfer_fastdata(a, addr);                      /* Send address. */

    //
    // The below for loop seems to be where our biggest programming time bottleneck is.
    //

    /* Download data. */
    int i;
    for (i = 0; i < words_per_row; i++) {
        xfer_fastdata(a, *data++);               /* Send word. */
    }

    unsigned response = get_pe_response(a);
    if (response != (PE_ROW_PROGRAM << 16)) {
        fprintf(stderr, "\nfailed to program row at %08x, reply = %08x\n",
                                                     addr,         response);
        exit(-1);
    }
}

/*
 * Verify a block of memory.
 */
static void bitbang_verify_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;
    unsigned data_crc, flash_crc;

    if (DBG2)
        fprintf(stderr, "verify_data\n");
    if (DBG3)
        fprintf(stderr, "\nverifying %u words at %08x ", nwords, addr);

    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "slow verify not implemented yet\n");
        exit(-1);
    }

    /* Use PE to get CRC of flash memory. */
    bitbang_send(a, 1, 1, 5, ETAP_FASTDATA, 0);  /* Send command. */
    xfer_fastdata(a, PE_GET_CRC << 16);
    xfer_fastdata(a, addr);                      /* Send address. */
    xfer_fastdata(a, nwords * 4);                /* Send length. */

    unsigned response = get_pe_response(a);
    if (response != (PE_GET_CRC << 16)) {
        fprintf(stderr, "\nfailed to verify %d words at %08x, reply = %08x\n",
                                             nwords,     addr,       response);
        exit(-1);
    }

    flash_crc = get_pe_response(a) & 0xffff;

    data_crc = calculate_crc(0xffff, (unsigned char*) data, nwords * 4);
    if (flash_crc != data_crc) {
        fprintf(stderr, "\nchecksum failed at %08x: returned %04x, expected %04x\n",
                                               addr,        flash_crc,     data_crc);
        exit(-1);
    }
}

/*
 * Initialize bitbang adapter.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 */
adapter_t *adapter_open_bitbang(const char *port, int baud_rate)
{
    bitbang_adapter_t *a;

    printf("       (ascii ICSP coded by Robert Rozee)\n\n");

//
// the following block of code is used to upload firmware to
// an attached Arduino NANO using the STK500v1 protocol:
// PIC32PROG -d ASCII:COM5 -b3
//
// once the firmware upload is completed, exits from pic32prog
//

    if (baud_rate < 5)                                  // invoked by a baud rate of 1, 2, 3, or 4.
    {
#if 1                                                   // change to 0 to not compile in firmware uplaod
        #define STK_GET_SYNC            0x30            // synchronize
        #define STK_ENTER_PROGMODE      0x50            // enter program mode
        #define STK_READ_SIGN           0x75            // read signature
        #define STK_LOAD_ADDRESS        0x55            // load address
        #define STK_PROG_PAGE           0x64            // program page
        #define STK_LEAVE_PROGMODE      0x51            // exit program mode

        #define CRC_EOP                 0x20            // end of packet

        #define STK_INSYNC              0x14            // response - insync
        #define STK_OK                  0x10            // response - OK

        #include "bitbang/ICSP_v1E.inc"

        int i, n;
        unsigned char buffer [140];                     // 0x80 + 12d (max used is 133)
        int bps[] = {0, 9600, 19200, 57600, 115200 };   // known arduino bootloader baud rates

