sergev/pic32prog/adapter-bitbang.c
        if (serial_open(port, bps[baud_rate]) < 0) {
            fprintf(stderr, "Unable to configure serial port %s\n", port);
            serial_close();
            exit(-1);
        }
        printf("%i baud ", bps[baud_rate]);
        fflush(stdout);

        for (i = 0; i < 40; i++) {

            buffer[0] = STK_GET_SYNC;                   // get synchronization
            buffer[1] = CRC_EOP;

            serial_write(buffer, 2);
            printf(".");
            fflush(stdout);
            n = serial_read(buffer, 2, 100);
            if ((n == 2) && (buffer[0] == STK_INSYNC) && (buffer[1] == STK_OK))
                i = 100;
        }

        if (i < 100) {
            fprintf(stderr, "\nFailed to find arduino/STK500 bootloader\n");
            serial_close();
            exit(-1);
        }
        printf(" synchronized\n");

        buffer[0] = STK_ENTER_PROGMODE;                 // enter program mode (not needed)
        buffer[1] = CRC_EOP;
        serial_write(buffer, 2);
        n = serial_read(buffer, 2, 100);

        if ((n != 2) || (buffer[0] != STK_INSYNC) || (buffer[1] != STK_OK)) {
            fprintf(stderr, "Failed to enter program mode\n");
            serial_close();
            exit(-1);
        }

        buffer[0] = STK_READ_SIGN;                      // read signature bytes (3)
        buffer[1] = CRC_EOP;
        serial_write(buffer, 2);
        n = serial_read(buffer, 5, 100);

        if ((n != 5) || (buffer[0] != STK_INSYNC) || (buffer[4] != STK_OK)) {
            fprintf(stderr, "Failed to get signature\n");
            serial_close();
            exit(-1);
        }
        unsigned ID = (buffer[1] << 16) + (buffer[2] << 8) + buffer[3];
        printf("Signature = %06x   Device = %s\n", ID, ID == 0x1e950f ? "ATmega328P" : "(wrong uP)");

        for (i = 0; i < sizeof(ICSP); i += 0x80)
            printf(".");
        for (i = 0; i < sizeof(ICSP); i += 0x80)
            printf("\b");

        for (i = 0; i < sizeof(ICSP); i += 0x80) {
            printf("#");
            fflush(stdout);

            buffer[0] = STK_LOAD_ADDRESS;               // load address
            buffer[1] = (i >> 1) % 0x100;               // address low (word boundary)
            buffer[2] = (i >> 1) / 0x100;               // address high
            buffer[3] = CRC_EOP;
            serial_write(buffer, 4);
            n = serial_read(buffer, 2, 100);

            if ((n != 2) || (buffer[0] != STK_INSYNC) || (buffer[1] != STK_OK)) {
                fprintf(stderr, "\nFailed to load address %04x\n", i);
                serial_close();
                exit(-1);
            }

            buffer[0] = STK_PROG_PAGE;                  // program page
            buffer[1] = 0x00;                           // length high (in bytes, NOT words)
            buffer[2] = 0x80;                           // length low (order reverse to address)
            buffer[3] = 'F';                            // memory type: 'E' = eeprom, 'F' = flash
            memcpy(&buffer[4], &ICSP[i], 0x80);         // data (128 bytes)
            buffer[4 + 0x80] = CRC_EOP;
            serial_write(buffer, 4 + 0x80 + 1);
            n = serial_read(buffer, 2, 100);

            if ((n != 2) || (buffer[0] != STK_INSYNC) || (buffer[1] != STK_OK)) {
                fprintf(stderr, "\nFailed to program page\n");
                serial_close();
                exit(-1);
            }
        }
        printf("\n");

        buffer[0] = STK_LEAVE_PROGMODE;                 // leave program mode
        buffer[1] = CRC_EOP;
        serial_write(buffer, 2);
        n = serial_read(buffer, 2, 100);

        if ((n != 2) || (buffer[0] != STK_INSYNC) || (buffer[1] != STK_OK)) {
            fprintf(stderr, "Failed to exit program mode\n");
            serial_close();
            exit(-1);
        }
        printf("Firmware uploaded to 'ascii ICSP' adapter OK\n");
        serial_close();
#else
        printf("Firmware upload to arduino/STK500 not included\n");
#endif
        exit(0);                                       // finished performing function, exit program
    }

//
// carry on with normal startup
//

    a = calloc(1, sizeof(*a));
    if (! a) {
        fprintf(stderr, "Out of memory (in open)\n");
        return 0;
    }

    /* Open serial port */
    if (serial_open(port, 115200) < 0) {
        /* failed to open serial port */
        fprintf(stderr, "Unable to configure serial port %s\n", port);
        serial_close();
        free(a);
        return 0;
    }
    usleep(200000);

    //
    // Serial port now open and configured.
    //
    printf("      Adapter: ");
    fflush(stdout);

    int i, n;
    unsigned char ch;
    for (i = 0; i < 40; i++) {
        ch = '>';
        serial_write(&ch, 1);
        ch = (i < 20 ? '.': ':');
        if (i == 20)
            for (n = 0; n < 20; n++ )
                printf("\b");
        printf("%c", ch);
        fflush(stdout);
        n = serial_read(&ch, 1, 250);
        if (n == 1 && ch == '<')
            i = 100;
    }

    if (i < 100) {
        fprintf(stderr, "\nNo response from 'ascii ICSP' adapter\n");
        serial_close();
        free(a);
        return 0;
    }
    printf(" OK1");
    fflush(stdout);

    ch = '?';
    unsigned char buffer[15] = "..............\0";
                            // "ascii ICSP v1X"
    serial_write(&ch, 1);
    n = serial_read(buffer, 14, 250);

    if (n == 14 && memcmp(buffer, "ascii ICSP v1", 13) == 0)
        printf(" OK2 - %s\n", buffer);
    else {
        fprintf(stderr, "\nBad response from 'ascii ICSP' adapter\n");
        serial_close();
        free(a);
        return 0;
    }

    //
    // This is the end of 'ascii ICSP' ID probe
    //

    a->BitsToRead = 0;
    a->CharToRead = 0;
    a->PendingHandshake = 0;               // handshake read req'd before next write

    a->TotalCodeChrsSent = 0;              // count of total # of code characters sent out
    a->TotalCodeChrsRecv = 0;              // count of total # of code characters received
    a->TotalBitPairsSent = 0;              // count of total # of TDI+TMS bits sent
    a->TotalBitsReceived = 0;              // count of total # of TDO bits recieved
    a->MaxBufferedWrites = 0;              // maximum continuous write length (chars)
    a->RunningWriteCount = 0;              // running count of writes, reset by read

    a->WriteCount = 0;
    a->Read1Count = 0;
    a->Read2Count = 0;
    a->FDataCount = 0;
    for (i = 0; i < 4; i++)
        a->DelayCount[i] = 0;

    a->use_executive = 0;
    a->serial_execution_mode = 0;

    //
    // It is at this point that we start talking to the target.
    //

