sergev/pic32prog/adapter-bitbang.c
    bitbang_ICSP_enable(a, 1);
    gettimeofday(&a->T1, 0);

    //
    // The below few lines enable a forced "emergency" erase,
    // use -b8 for MX processors, -b9 for MZ processors
    //
    // once the erase is completed, exits from pic32prog
    //

    if ((baud_rate >> 1) == 4) {                        // 8 (MX) or 9 (MZ)
        printf("\nAttempting blind erase of %s processor\n",
            (baud_rate & 1) ? "MZ" : "MX");
        bitbang_send(a, 6, 31, 0, 0, 0);                // don't care about ID
        bitbang_send(a, 1, 1, 5, TAP_SW_MTAP, 0);       /* Send command. */
        bitbang_send(a, 1, 1, 5, MTAP_COMMAND, 0);      /* Send command. */
        bitbang_send(a, 0, 0, 8, MCHP_ERASE, 0);        /* Xfer data. */
        if (baud_rate & 1)
            bitbang_send(a, 0, 0, 8, MCHP_DEASSERT_RST, 0); // PIC32MZ devices only.
        bitbang_delay10mS(a, 0);
        bitbang_send(a, 0, 0, 8, MCHP_STATUS, 1);       /* Xfer data. */
        usleep(1000000);                                // allow 1 second for erase to complete
        bitbang_ICSP_enable(a, 0);                      // shut down target
        serial_close();
        free(a);
        exit(0);                                        // finished performing function, exit program
    }

    /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
     * After reset, the IDCODE register is always selected.
     * Read out 32 bits of data. */
    unsigned idcode;
    bitbang_send(a, 6, 31, 32, 0, 1);                                       // 1. (pg 20)
    idcode = bitbang_recv(a);
    if ((idcode & 0xfff) != 0x053) {
        /* Microchip vendor ID is expected. */
        if (debug_level > 0 || (idcode != 0 && idcode != 0xffffffff))
            fprintf(stderr, "incompatible CPU detected, IDCODE=%08x\n", idcode);
        bitbang_ICSP_enable(a, 0);                      // shut down target
        serial_close();
        free(a);
        return 0;
    }

    /* Check status. */
    bitbang_send(a, 1, 1, 5, TAP_SW_MTAP, 0);       /* Send command. */     // 2.
    bitbang_send(a, 1, 1, 5, MTAP_COMMAND, 0);      /* Send command. */     // 3.
#ifdef OLDWAY
    bitbang_send(a, 0, 0, 8, MCHP_FLASH_ENABLE, 0); /* Xfer data. */        // may be an issue for MZ
    // (above line) "This command requires a NOP to complete."
#else
    bitbang_send(a, 0, 0, 8, MCHP_STATUS, 0);       /* Xfer data. */        // 4a.
    bitbang_delay10mS(a, 3);
#endif
    bitbang_send(a, 0, 0, 8, MCHP_STATUS, 1);       /* Xfer data. */        // 4b.
    unsigned status = bitbang_recv(a);
    if (debug_level > 0)
        fprintf(stderr, "status %04x\n", status);
#ifdef OLDWAY
    if ((status & ~MCHP_STATUS_DEVRST) !=
        (MCHP_STATUS_CPS | MCHP_STATUS_CFGRDY | MCHP_STATUS_FAEN)) {
#else
    if ((status & (MCHP_STATUS_CFGRDY | MCHP_STATUS_FCBUSY)) != MCHP_STATUS_CFGRDY) {
#endif
        fprintf(stderr, "invalid status = %04x (in open)\n", status);       // 5.
        bitbang_ICSP_enable(a, 0);                  // shut down target
        serial_close();
        free(a);
        return 0;
    }
//
// the above two blocks of code that get the device ID and check status have been altered to
// bring into line with the current microchip recommendations. this also removes a potential
// incompatibility with MZ family devices, which do not support MCHP_FLASH_ENABLE.
//
// see: Microchip document 60001145N, "PIC32 Flash Programming
// Specification, DS60001145N page 20 (8.0 CHECK DEVICE STATUS)
//
// to return to old method, add line #define OLDWAY
//

    a->adapter.block_override = 0;
    a->adapter.flags = AD_PROBE | AD_ERASE | AD_READ | AD_WRITE;

    /* User functions. */
    a->adapter.close = bitbang_close;
    a->adapter.get_idcode = bitbang_get_idcode;
    a->adapter.load_executive = bitbang_load_executive;
    a->adapter.read_word = bitbang_read_word;
    a->adapter.read_data = bitbang_read_data;
    a->adapter.verify_data = bitbang_verify_data;
    a->adapter.erase_chip = bitbang_erase_chip;
    a->adapter.program_word = bitbang_program_word;
    a->adapter.program_row = bitbang_program_row;
    return &a->adapter;
}
